{
  "education": [
    {
      "awards_achievements": [],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2022-2024",
      "school_name": "Université de Montréal"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KantyGakima.git",
  "highlighted_projects": [
    {
      "description": "Conducted a data analysis project focused on collecting, cleaning and transforming socio-economic and demographic indicators extracted from multiple Wikipedia data tables, using Python, Pandas, and NumPy, and Jupyter Notebook. Applied standard data preprocessing and exploratory analysis methods to identify and visualize patterns across countries.\n",
      "name": "International Data analysis"
    },
    {
      "description": "Developed a full-stack web application in a two-person team, that enables users to create, organize, and manage recipe tiles with real-time updates across all corrected users. Built with PHP, MySQL, JavaScript, HTML, and CSS, using a REST API and asynchronous fetch requests to support CRUD operations and instant synchronization.\n",
      "git_url": "https://github.com/Kanty-G/Recipe-management-application.git",
      "name": "Recipe Management Web App"
    },
    {
      "description": "Developed a Java-based reservation system focused on structured data modeling and system logic. Designed core components using object-oriented principles and UML diagrams with Visual paradigms, implemented key workflows for managing reservations, and validated functionality through unit testing with Junit. The project emphasized clean data structures, reliable application logic, and maintainable code architecture aligned with engineering best practices.",
      "name": "Travel reservation system"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a distributed monitoring agent using Bash/Shell scripts to capture hardware specifications and real-time resource metrics across multiple hosts.  Deployed a Docker-containerized PostgreSQL database to store collected data and automated ingestion using crontab.  The solution provides continuous, minute-level data collection suitable for data analytics, performance monitoring, and maintenance.\n",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Kanty Gakima",
  "others": [],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed and developed data workflows and backend components using SQL, Python, Java, Bash, and Linux-based tooling. Implemented automation scripts and containerized environments with Docker. Collaborated within an Agile team using Git to deliver maintainable and well-structured solutions.",
      "duration": "2025-present",
      "title": "Data Engineer"
    },
    {
      "company": "Université de Montréal - Philanthropy and Alumni Department",
      "description": "Managed, validated, and updated alumni and donor data in compliance with governance and confidentiality standards. Supported outreach campaigns by conducting high-volume outbound calls and analyzing performance results to refine scripts and improve interaction quality. Contributed to onboarding and training by enhancing internal documentation, updating workflows, and providing guidance to new assistants.",
      "duration": "2022-Present",
      "title": "Technical Assistant (Part-time)"
    },
    {
      "company": "TD Canada Trust",
      "description": "Handled and documented 70+ daily interactions related to credit card management and account openings while maintaining strict compliance with security and confidentiality standards. Analyzed client profiles to recommend tailored financial products that supported customer satisfaction and an improved user experience. Collaborated with internal teams to resolve incidents and anomalies efficiently, ensuring all cases were clearly, accurately, and traceably documented.",
      "duration": "2024-2025",
      "title": "Bilingual credit card specialist"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "REACT",
      "Data modeling and ETL concepts",
      "Cloud fundamentals (GCP/AWS concepts)",
      "JUnit",
      "JavaScript"
    ],
    "familiar": [
      "Power BI",
      "MongoDB",
      "REST API",
      "PHP",
      "C++",
      "Apache Spark"
    ],
    "proficient": [
      "Java",
      "Python",
      "SQL (PostgreSQL, MySQL)",
      "Linux/Bash",
      "Pandas/Numpy",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Computer Science graduate with practical experience in software development, data processing, and data-driven applications. I have worked extensively with Python, SQL, Bash, and Java through academic and hands-on projects, and developed strong analytical abilities, attention to detail, and clear technical communication through technical support and client-facing roles. I am interested in opportunities in data engineering, data analytics, or related technical fields, where I can contribute to building data pipelines, automation workflows, and efficient, well-structured solutions."
}
