{
  "education": [
    {
      "awards_achievements": [],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2022-2024",
      "school_name": "Université de Montréal"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KantyGakima.git",
  "highlighted_projects": [
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Web app for resturant"
    },
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": null,
      "name": "Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a distributed monitoring agent using Bash/shell scripts to capture hardware specifications and real-time resource metrics across multiple hosts. Deployed a docker containerized PostgreSQL database to store the collected data and automated the ingestion using crontab. The solution provides continuous, minute-level data collection suitable for data analytics, performance monitoring and maintenance.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Kanty Gakima",
  "others": [
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming",
        "Volunteer, ABC Food bank: Ut enim ad minim veniam"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2025-present",
      "title": "Data Engineer"
    },
    {
      "company": "Université de Montréal - Philanthropy and Alumni Department",
      "description": "Managed, validated, and updated alumni and donor data in compliance with governance and confidentiality standards. Supported outreach campaigns by conducting high-volume outbound calls and analyzing performance results to refine scripts and improve interaction quality. Contributed to onboarding and training by enhancing internal documentation, updating workflows, and providing guidance to new assistants.",
      "duration": "2022-Present",
      "title": "Technical Assistant (Part-time)"
    },
    {
      "company": "TD Canada Trust",
      "description": "Handled and documented 70+ daily interactions related to credit card management and account openings while maintaining strict compliance with security and confidentiality standards. Analyzed client profiles to recommend tailored financial products that supported customer satisfaction and an improved user experience. Collaborated with internal teams to resolve incidents and anomalies efficiently, ensuring all cases were clearly, accurately, and traceably documented.",
      "duration": "2024-2025",
      "title": "Bilingual credit card specialist"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "REACT",
      "JUnit",
      "Data modeling and ETL concepts",
      "Cloud fundamentals (GCP/AWS concepts)"
    ],
    "familiar": [
      "Donec",
      "fermentum",
      "fermentum",
      "fermentum",
      "fermentum"
    ],
    "proficient": [
      "Java",
      "Python",
      "SQL (PostgreSQL, MySQL)",
      "Linux/Bash",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Computer Science graduate with practical experience in software development, data processing, and data-driven applications. I have worked extensively with Python, SQL, Bash, and Java through academic and hands-on projects, and developed strong analytical abilities, attention to detail, and clear technical communication through technical support and client-facing roles. I am interested in opportunities in data engineering, data analytics, or related technical fields, where I can contribute to building data pipelines, automation workflows, and efficient, well-structured solutions."
}
