{
  "education": [
    {
      "awards_achievements": [],
      "degree": "**Bachelor of Science**",
      "department": "**Computer Science** (Relevant coursework : Algorithms \u0026 Data Structures, Databases, Data Science, Web Development, Object-Oriented Programming, Software Design, Machine Learning, Probability \u0026 Statistics)",
      "duration": "2022-2024",
      "school_name": "Université de Montréal"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KantyGakima.git",
  "highlighted_projects": [
    {
      "description": "Conducted a data analysis project focused on collecting, cleaning and transforming socio-economic and demographic indicators extracted from multiple Wikipedia data tables, using Python, Pandas, NumPy, Matplotlib and Jupyter Notebook. Applied standard data preprocessing and exploratory analysis methods to identify and visualize patterns across countries.\n",
      "name": "International Data analysis"
    },
    {
      "description": "Developed a full-stack web application that helps users store all their favourite recipes in one place and keep them easily accessible. The app allows any user to add, edit, and delete their own recipes, with updates appearing in real time for everyone. Built using PHP, MySQL, JavaScript, HTML, CSS, and supported by a simple REST API with asynchronous fetch requests to handle all CRUD operations and keep the interface in sync.rt CRUD operations and instant synchronization.\n",
      "git_url": "https://github.com/Kanty-G/Recipe-management-application.git",
      "name": "Recipe Management Web App"
    },
    {
      "description": "Developed a Java-based reservation system centered on structured data modelling and system logic. Designed core components using object-oriented principles and UML diagrams in Visual Paradigm, implemented reservation workflows, and validated functionality with JUnit tests. The project focused on clean data structures, reliable application logic, and maintainable code aligned with software engineering best practices.\n",
      "name": "Travel reservation system"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a monitoring system using Bash/Shell scripts and Linux utilities to collect hardware specifications and real-time usage metrics from multiple Linux hosts.  Deployed a Docker-containerized PostgreSQL database to store collected data and automated continuous data ingestion using crontab.  The system provides a centralized and reliable data pipeline for performance monitoring, analytics, and maintenance.\n",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Kanty Gakima",
  "others": [
    {
      "bullets": [
        "Scratch programming instructor (2019-2020) for children aged 6 to 12, teaching basic programming concepts through animations and games.",
        "Girl Scout: Treasurer (2017-2020) and early teens instructor (2018-2020), organizing weekly educational activities and quarterly community volunteering initiatives."
      ],
      "title": "Community Involvement"
    },
    {
      "bullets": [
        "Hiking enthusiast"
      ],
      "title": "Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed and developed data workflows and backend components using SQL, Python, Java, Bash, and Linux-based tooling. Implemented automation scripts and containerized environments with Docker. Collaborated within an Agile team using Git to deliver maintainable and well-structured solutions.",
      "duration": "2025-present",
      "title": "Data Engineer"
    },
    {
      "company": "TD Canada Trust",
      "description": "Handled and documented 70+ daily interactions related to credit card management and account openings while maintaining strict compliance with security and confidentiality standards. Analyzed client profiles to recommend tailored financial products that supported customer satisfaction and an improved user experience. Collaborated with internal teams to resolve incidents and anomalies efficiently, ensuring all cases were clearly, accurately, and traceably documented.",
      "duration": "2024-2025",
      "title": "Bilingual credit card specialist"
    },
    {
      "company": "Université de Montréal - Philanthropy and Alumni",
      "description": "Managed, validated, and updated alumni and donor data in compliance with governance and confidentiality standards. Supported outreach campaigns by conducting high-volume outbound calls and analyzing performance results to refine scripts and improve interaction quality. Contributed to onboarding and training by enhancing internal documentation, updating workflows, and providing mentoring to new assistants.",
      "duration": "2022-Present",
      "title": "Technical Assistant (Part-time)"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "REACT",
      "JUnit",
      "JavaScript",
      "REST API",
      "Apache Spark",
      "Data modelling and ETL concepts",
      "Cloud fundamentals (GCP/AWS concepts)"
    ],
    "familiar": [
      "Power BI",
      "Matplotlib",
      "MongoDB",
      "PHP",
      "C++"
    ],
    "proficient": [
      "Java",
      "Python",
      "Pandas/Numpy",
      "SQL (PostgreSQL, MySQL)",
      "Linux/Bash",
      "Git",
      "Agile/Scrum"
    ]
  },
  "summary": "Computer Science graduate from Université de Montréal with  hands-on experience in software development, data processing, and building data-driven tools. Currently working as a Data Engineer at Jarvis, where I design and implement data workflows, automation scripts, and backend components using Python, SQL, Java, Bash, Docker, and Linux-based tooling. I work within an Agile/Scrum environment, collaborating with the team to deliver reliable, well-structured solutions. I have developed a strong foundation in data modelling, pipeline development, and efficient problem-solving. Eager to apply my skills in data engineering, analytics, or related fields while continuing to grow my expertise.\n"
}
